perf/10a500.yaml
config:
  environments:
    node:
      target: 'http://localhost:5556/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5556/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    node_rep:
      target: 'http://localhost:5556/node_rep'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node_rep"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: primeros 10 seg con 10
      duration: 10
      arrivalRate: 10
    - name: siguientes 10 seg con 500
      duration: 10
      arrivalRate: 500
    - name: siguientes 10 seg con 10
      duration: 10
      arrivalRate: 10
    - name: siguientes 10 seg con 500
      duration: 10
      arrivalRate: 500

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/veloz'