perf/timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5556/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5556/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    node_rep:
      target: 'http://localhost:5556/node_rep'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node_rep"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: primer plain
      duration: 30
      arrivalRate: 10
    - name: subo
      duration: 300
      arrivalRate: 10
      rampTo: 250
    - name: me quedo arriba
      duration: 30
      arrivalRate: 250

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/timeout'